# Pandas

## Series
Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [3]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [4]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [5]:
ser = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])  
ser

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [6]:
ser['USA']

1

## DataFrames
DataFrames are the workhorse of pandas. We can think of a DataFrame as a bunch of Series objects put together to share the same index.

In [7]:
from numpy.random import randn
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.213770  1.098385  0.376950  0.909192
B  0.014271 -1.003408  1.327228 -0.943785
C  0.523094  1.286713 -0.117712 -0.093103
D -0.661861  0.369847  0.241364  0.193386
E -1.196413 -0.225437 -0.007712 -1.128220

In [8]:
df[['W','Z']]

          W         Z
A  0.213770  0.909192
B  0.014271 -0.943785
C  0.523094 -0.093103
D -0.661861  0.193386
E -1.196413 -1.128220

In [9]:
type(df['W'])

pandas.core.series.Series

In [10]:
# creating a new column
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  0.213770  1.098385  0.376950  0.909192  0.590720
B  0.014271 -1.003408  1.327228 -0.943785  1.341498
C  0.523094  1.286713 -0.117712 -0.093103  0.405382
D -0.661861  0.369847  0.241364  0.193386 -0.420497
E -1.196413 -0.225437 -0.007712 -1.128220 -1.204124

In [11]:
df.drop('new',axis=1,inplace=True)
df
# dropping colum

          W         X         Y         Z
A  0.213770  1.098385  0.376950  0.909192
B  0.014271 -1.003408  1.327228 -0.943785
C  0.523094  1.286713 -0.117712 -0.093103
D -0.661861  0.369847  0.241364  0.193386
E -1.196413 -0.225437 -0.007712 -1.128220

In [12]:
df.loc['B','Y']

1.3272278674152458

In [13]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.213770  0.376950
B  0.014271  1.327228

In [14]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False   True  False
C   True   True  False  False
D  False   True   True   True
E  False  False  False  False

In [15]:
newind = 'CA NY WY OR CO'.split()
df['States'] = newind
df

          W         X         Y         Z States
A  0.213770  1.098385  0.376950  0.909192     CA
B  0.014271 -1.003408  1.327228 -0.943785     NY
C  0.523094  1.286713 -0.117712 -0.093103     WY
D -0.661861  0.369847  0.241364  0.193386     OR
E -1.196413 -0.225437 -0.007712 -1.128220     CO

## Missing Data
Few convenient methods to deal with Missing Data in pandas:

In [16]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [17]:
df.dropna()
# unless you write inplace=true, it wont be actually dropped from the dataframe

     A    B  C
0  1.0  5.0  1

In [18]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [19]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [20]:
df.fillna(value='-100')

      A     B  C
0     1     5  1
1     2  -100  2
2  -100  -100  3

In [21]:
df['A'].fillna(value=df['A'].mean(), inplace=True)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

## Groupby & Merging

In [22]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [23]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [24]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [25]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [26]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [27]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [28]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [29]:
left['A'].unique()

array(['A0', 'A1', 'A2', 'A3'], dtype=object)

In [30]:
left['A'].nunique()

4

In [31]:
left['A'].value_counts()

A2    1
A3    1
A1    1
A0    1
Name: A, dtype: int64

## Applying Functions

In [ ]:
df

In [33]:
def times2(x):
    return x*2
df['Sales'] = df['Sales'].apply(times2)
df

  Company   Person  Sales
0    GOOG      Sam    400
1    GOOG  Charlie    240
2    MSFT      Amy    680
3    MSFT  Vanessa    248
4      FB     Carl    486
5      FB    Sarah    700

In [34]:
df['Sales'].sum()

2754

In [35]:
df.isnull()

   Company  Person  Sales
0    False   False  False
1    False   False  False
2    False   False  False
3    False   False  False
4    False   False  False
5    False   False  False

## Data Input and Output

Getting input and output, pandas can read a variety of file types using its pd.read_ methods - <br/>
df = pd.read_csv('example') <br/>
df = pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1') <br/>
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html') <br/>
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

### <div style="text-align: right"> Developed & Curated by Mr. Ronik Dedhia</div>